{
    "recipes": {
      "sample_recipe": {
        "title": [""],
        "subtitle": [""],

        "ingredients": [
            "",
            "",
            ""
        ],

        "optional": [""],
        "optional_ingredient": [
            ""
        ],

        "optional2": [""],
        "optional_ingredient2": [
            ""
        ],

        "instructions": [
          "",
          "",
          ""
        ]

      },

      "deep_dish": {
        "title": ["Deep Dish"],
        "subtitle": ["Makes 1 big pizza"],

        "ingredients": [
            "",
            "",
            ""
        ],

        "optional": [""],
        "optional_ingredient": [
            ""
        ],

        "optional2": [""],
        "optional_ingredient2": [
            ""
        ],

        "instructions": [
          "",
          "",
          ""
        ]

      },


        "italian_sub": {
          "title": ["Italian Sub"],
          "subtitle": ["Makes 1 8\" sub"],
  
          "ingredients": [
              "8\" sub bun",
              "Capocollo",
              "Salami",
              "Pepperoni",
              "provalone",
              "~70g lettuce",
              "Salted tomeatoes"
          ],
  
          "optional": ["Sub Dressing:"],
          "optional_ingredient": [
            "30g olive oil",
            "15g red wine vinegar",
            "1 tsp dried oregano",
            "½ tsp garlic powder",
            "a couple cranks of black pepper",
            "salt to taste"
          ],

          "optional2": ["Garlic Basil Lemon Mayo:"],
          "optional_ingredient2": [
            "60g, ~4 heaping spoons of mayo",
            "1 clove of garlic, grated or minced",
            "the juice from 1 slice of lemon (~10g)",
            "3-4 pinches minced basil"
          ],
  
          "instructions": [
              "Mix all dressing ingredients in a small bowl, mix all mayo ingredients in separate small bowl.",
              "Toss lettuce and ~2 spoonfulls or ~14g of dressing together in a normal sized bowl.",
              "Cut bread in half, plop and spread mayo on both pieces.",
              "Assemble in the following order: Bread, mayo, capocollo, salami, pepperoni, provalone, dressed lettuce, salted tomeatoes, mayo, bread.",
              "wrap it in some wax paper or parchment paper."
          ]
  
        },



      "souvlaki": {
        "title": ["Souvlaki"],
        "subtitle": ["Makes 4 servings"],

        "ingredients": [
            "1½ lbs chicken breasts (boneless, skinless, cubed)",
            "¼ cup olive oil",
            "1 lemon (juiced, 3 tbsp)",
            "2 garlic cloves, minced",
            "1 tbsp dried oregano",
            "¼ tsp salt",
            "¼ tsp freshly ground black pepper"
        ],

        "optional": ["Garnish:"],
        "optional_ingredient": [
            "1 small red onion",
            "2 plum tomeatoes",
            "Tzatziki Sauce",
            "Pita bread",
            "Lemon slices"
        ],

        "instructions": [
            "Cut chicken into bite size pieces and transfer into a gallon size ziploc babeg.",
            "Mix together the olive oil, lemon juice, garlic, oregano, salt, and pepper, and pour over chicken. Squeeze air out of bag and seal. Toss chicken to coat and transfer to refrigerator to marinate for 45mins-1hr.",
            "Remove chicken from marinade and thread onto metal skewers. Leave some space between the pieces, don't pack too closely together,",
            "Preheat grill to medium-high. Clean and oil grill to prevent food from sticking.",
            "Cook the skewers for 8-10 mins, turning until golden brown on all sides. Baste at least once with reserved marinade, being sure to discard any leftover marinade. Chicken is done cooking when food thermometer reads 165ºF (chicken will continue to cook as it rests). Allow chicken to rest 5 minutes before serving.",
            "Heat pita on grill to warm up and soften, if desired.",
            "Serve with optional garnish ingredients."
        ]

      },



        "texas_roll_house": {
          "title": ["Texas Roll House"],
          "subtitle": ["Roll out the rolls"],
  
          "ingredients": [
              "4 tsp active dry yeast",
              "½ cup (125ml) warm water",
              "1 tsp sugar (to activate yeast)",
              "2 cups (488ml) malk (scaled and cooled to lukewarm)",
              "3 tbsp (44.5g) unsalted butter, melted and slightly cooled",
              "½ cup (100g) sugar",
              "7 cups (857g) AP flour (up to 8 cups)",
              "2 eggs",
              "2 tsp salt",
              "2 tbsp (30g) butter (for brushing)"
          ],
  
          "instructions": [
              "Add the yeast, warm water and sugar to the bowl of your mixer and lightly whisk. Let it sit for about 10 to 15 minutes until the yeast dissolves and starts to foam.",
              "To the bowl of your mixer add the milk, butter, sugar, eggs and salt. Lightly mix everything together, using the dough hook of your mixer, for about 1 minute. Add the flour, 2 or 3 cups (250g, 375g) at a time, and mix. Add enough flour to form a soft dough.",
              "Add additional flour as needed and mix until the dough comes clean from the sides of the bowl. You could use anywhere from 6-8 cups (750g-1kg), depending on your environment. Place the dough in an oiled bowl and cover with a clean damp kitchen towel. Let rise in a warm place until double in bulk.",
              "Spray two baking sheets with cooking spray.",
              "Punch down the dough and turn it onto a floured surface. Divide into 2 portions for shaping. I like to roll out the dough so that it’s about 1/2 inch in thickness then cut out the ends to have a perfect rectangle, then cut it out into squares or rectangles. Repeat with remaining dough.  You should get about 30 to 35 rolls. Place onto the prepared baking sheets. Let the rolls rise until doubled in size.",
              "Preheat your oven to 350°F",
              "Bake the rolls for about 15 to 20 minutes or until golden brown. Brush immediately with melted butter.",
              "While the rolls are baking, prepare the cinnamon honey butter by whisking all the ingredients together."
          ]
  
        },


      "cast_iron_brats": {
        "title": ["Cast Iron Brats"],
        "subtitle": ["Buttery goodness"],

        "ingredients": [
            "A package of brats",
            "2 tbsp butter",
            "Some red onion"
        ],

        "instructions": [
            "Pre-heat cast iron pan to 350°F in the oven, then place on stove over medium-high heat and melt the butter.",
            "Sear brats 3 minutes per side.",
            "Flip one more time and turn heat to medium-low, add onions, and cover pan with a lid and cook for 5 minutes.",
            "Flip once more and cook for 2-3 minutes, until internal temp reaches 160°F."
        ]

      },


      "chicken_flappers": {
        "title": ["Chicken Flappers"],
        "subtitle": ["Grandma's recipe"],

        "ingredients": [
            "3 lbs. wings",
            "1 cup soy sauce",
            "1 cup brown sugar",
            "¾ cup butter or oleo",
            "½ cup water",
            "1 Tbsp dry mustard"
        ],

        "optional": ["for 6lbs. wings = 1.5 batches"],
        "optional_ingredient": [
            ""
        ],

        "optional2": ["Very good for snacks."],
        "optional_ingredient2": [
            ""
        ],

        "instructions": [
          "Bake at 350°F for 1.5hrs",
          "",
          ""
        ]

      },


      "mushroon_gnocchi": {
        "title": ["Mushroom Gnocchi"],
        "subtitle": ["Makes 4 nyokey's"],

        "ingredients": [
            "1 tbsp olive oil",
            "8oz mushrooms crimini",
            "16oz potato gnocchi",
            "½ cup chicken broth",
            "1 cup heavy cream",
            "4 garlic cloves, minced",
            "½ tsp italian seasoning",
            "½ tsp smoked paprika",
            "5oz (142g) fresh spinach",
            "¼ tsp salt to taste",
            "coarsly ground black pepper to taste",
            "red pepper flakes to taste"
        ],

        "instructions": [
            "Heat 1 tablespoon olive oil in a large, high-sided, heavy-bottomed skillet.",
            "Cook sliced mushrooms (seasoned with salt and pepper) on high heat for about 1 or 2 minutes, until lightly browned and softened.",
            "Remove half of the cooked mushrooms from the skillet to a plate.",
            "To the same skillet with the half of cooked mushrooms, add uncooked potato gnocchi, chicken broth, heavy cream, minced garlic, Italian seasoning, smoked paprika, and ¼ teaspoon salt.",
            "Bring to a boil on medium heat and stir everything well. Cover with lid, and allow the gnocchi to cook for about 5 minutes on medium heat, while the sauce boils.",
            "Add fresh spinach, and cook on medium heat, stirring frequently for 5 minutes until the spinach wilts to your liking. Cook longer if you would like a thicker sauce.",
            "Season with more salt, freshly ground coarse black pepper, red pepper flakes, and smoked paprika, if you like.",
            "Top with the remaining half of the cooked mushrooms."
        ]

      },



      "poached_egg": {
        "title": ["Poached Egg"],
        "subtitle": [""],

        "ingredients": [
            "Egg",
            "1-2 tbsp vinegar",
            "lotzza water"
        ],

        "optional": [""],
        "optional_ingredient": [
            ""
        ],

        "optional2": [""],
        "optional_ingredient2": [
            ""
        ],

        "instructions": [
          "Boil water and vinegar in a medium saucepan.",
          "Crack an egg into a fine mesh strainer sat atop a bowl, then give it a little swirl to remove the liquidy bits. Transfer the egg to a ramekin.",
          "Reduce heat and create a vortex in the water, gently lower the ramekin into the vortex to release the egg and cook for 3 mins.",
          "Remove egg with a slotted spoon and dab with a paper towel to remove any excess water. Throw on some salt and pepper."
        ]

      },



      "caesar_dressing": {
        "title": ["Caesar Dressing"],
        "subtitle": ["Makes 1 1/3 cups"],

        "ingredients": [
            "2 small garlic cloves, minced",
            "1 tsp anchovy paste",
            "2 tbsp freshly squeezed lemon juice",
            "1 tsp Dijon mustard",
            "1 tsp Worcestershire",
            "240g or 1 cup mayonnaise",
            "50g or ½ cup freshly grated Parmigiano-Reggiano",
            "¼ tsp salt",
            "¼ tsp freshly ground black pepper"
        ],

        "instructions": [
            "In a medium bowl, whisk together the garlic, anchovy paste, lemon juice, Dijon mustard, and Worcestershire sauce.",
            "Add the mayonnaise, Parmigiano-Reggiano, salt, and pepper and whisk until well combined.",
            "Taste and adjust to your liking. The dressing will keep well in the fridge for about a week."
        ]

      },



      "beurre_blanc": {
        "title": ["Beurre Blanc"],
        "subtitle": ["Not sure about this one"],

        "ingredients": [
            "1 tbsp unsalted butter",
            "¼ cup finely chopped shallots",
            "2 tbsp white-wine vinegar",
            "3 tbsp dry white wine",
            "6 tbsp unsalted butter, cut into 10 pieces"
        ],

        "optional": ["Note:"],
        "optional_ingredient": [
            "I've altered this recipe based on comments, I don't think this is the same one I used last time though. Wouldn't recommend using this recipe just yet."
        ],

        "instructions": [
            "Heat 1 tbsp of butter in a saucepan and add the shallots. Cook briefly, stirring, and add the vinegar and wine. Cook until reduced to half.",
            "Reduce heat to low and add salt. Add butter, one piece at a time, stirring rapidly with a wire whisk."
        ]

      },



      "crepes": {
        "title": ["Les Crêpes"],
        "subtitle": ["Makes a couple 2 tree"],

        "ingredients": [
            "2 cups malk",
            "1 cup flour",
            "1 egg",
            "½ tbsp melted butter"

        ],

        "optional": ["Cream Filling:"],
        "optional_ingredient": [
            "141g powdered sugar",
            "1 8oz package cream cheese, softened",
            "1 tbsp lemon juice",
            "1 tsp lemon zest",
            "½ tsp vanilla extract",
            "1 cup heavy cream"
        ],

        "instructions": [
            "Whisk together milk, flour, egg, and butter in a medium bowl. Place in refrigerator for 20mins.",
            "Whip heavy cream to stiff peaks.",
            "Beat powdered sugar, cream cheese, lemon juice, lemon zest, and vanilla in the bowl of a stand mixer fitted with the paddle attachment(i think, I may have used the whisk attachment) until smooth. Gently fold in whipped cream.",
            "Preheat pan on medium-low heat, rub butter all over it. Remove from heat and scoop ½ cup of batter into pan. Use gravity to evenly distribute batter. Place the pan back on the heat and fill in any gaps. turn the heat up to medium-high. Flip when the underside has golden spots. Repeat, buttering pan every other crêpe.",
            "Place filling onto half of the crêpe and fold into a quarter size.",
            "Makes 5 or 6 or something."
        ]

      },



      "apple_french_toast": {
        "title": ["Apple French Toast"],
        "subtitle": ["Makes 4 servings"],

        "ingredients": [
            "NOT FINISHED!!!!",
            "4 demi-Baguettes",
            "4 apples",
            "1 lemon",
            "4 eggs",
            "6.75oz malk",
            "4 tsp cinnamon, divided",
            "2 tbsp sugar",
            "a few pinches of salt",
            "4 tbsp maple syrup, divided",
            "5 tbsp butter, divided",
            "¾ cup water",
            "6 tbsp brown sugar",
            "1oz pecans",
            "2 tsp cooking oil",
            "8 tbsp crème fraîche"
        ],

        "optional": [""],
        "optional_ingredient": [
            ""
        ],

        "optional2": [""],
        "optional_ingredient2": [
            ""
        ],

        "instructions": [
          "Place oven rack to top position and preheat to 425ºF. Wash and dry produce. Trim ½\" on a diagomal from ends of baguettes and discard ends; evenly slice remaining bread on a diagonal into 3 oval-shaped pieces. Peel, half and core apples; dice into ½\" pieces. Quarter lemon.",
          "In a medium bowl, whisk together eggs, milk, 2 tsp cinnamon, 2 tbsp sugar, and a pinch of salt until well combined.",
          "Transfer egg mixture and baguette slices to a large, Ziploc bag; seal and toss to coat. Set aside, tossing occasionally, until bead is evenly soaked.",
          ""
        ]

      },



      "gingerbread_dudes": {
        "title": ["Gingerbread Dudes"],
        "subtitle": ["Makes 2-3 dozen dudes"],

        "ingredients": [
            "3 ½ cups AP flour, plus more for dusting",
            "1 tbsp ground ginger",
            "2 tsp ground cinnamon",
            "1 tsp baking soda",
            "1 tsp fine salt",
            "¼ tsp ground allspice",
            "¼ tsp ground cloves",
            "6 tbsp unsalted butter, melted",
            "1 tbsp vegetable shortening, melted",
            "⅔ cup light brown sugar",
            "¾ cup molasses",
            "1 large egg"
        ],

        "optional": ["Royal Icing:"],
        "optional_ingredient": [
            "3 egg whites (separated cold then warmed to room-temp)",
            "450g powdered sugar",
            "1 tsp vanilla extract"
        ],

        "instructions": [
            "Whisk together the flour, ginger, cinnamon, baking soda, salt, allspice, and cloves in a large bowl.",
            "Mix the butter, shortening, brown sugar, and molasses in the bowl of a stand mixer fitted with the paddle attachment. Beat in the egg. Beat the dry ingredients into the wet ingredients in two additions. Divide the dough in half, wrap in plastic and pat to 1/2in thick. Refrigerate for 2 hours.",
            "Preheat the oven to 350ºF.",
            "On a lightly floured surface, roll out one piece of dough to ¼ in thick, dusting with flour if needed. Cut into 3-5in cookies with a cookie cutter. Brush off the excess flour and refrigerate for 15mins. Repeat with the second piece of dough.",
            "Bake the cookies in batches until they are golden around the edges, 12-15mins. Transfer to wire rack and cool completely.",
            "Whisk egg whites in the bowl of a stand mixer on medium-low until frothy, about 1 minute",
            "With the mixer on low speed, slowly add the powdered sugar and vanilla",
            "Once fully incorperated, increase the speed to medium-high until stiff peaks form."
        ]

      },



      "hot_chocolate": {
        "title": ["Hot Chocolate"],
        "subtitle": ["Makes 1 cup for Santa"],

        "ingredients": [
            "¼ cup heavy cream",
            "¾ cup malk",
            "1.5 tbsp sugar",
            "2 tbsp dutch-process cocoa powder",
            "a pinch of salt",
            "¼ tsp vanilla",
            "1 square of Ghirardelli 60% baking bar"
        ],

        "optional": ["optional:"],
        "optional_ingredient": [
            "~¼ tsp ground ginger", "a couple shakes of cinnamon", "a bit of chili powder"
        ],

        "instructions":[
            "Combine malk and cream in a 1 cup measuring cup.",
            "Pour ~1oz malk mixture into 2 cup measuring cup.",
            "Heat the rest of the malk mixture in a saucepan until simmering (190ºF), stirring occasionally, do not boil.",
            "While heating, sift cocoa powder and add sugar, vanilla, cinnamon, and salt into the 1oz of malk mix.",
            "Whisk until well combined.",
            "Once hot enough, turn off heat and whisk in chocolate mixture.",
            "Use spare hand to break off pieces of chocolate square and slowly whisk into hot chocolate.",
            "Continue whisking for a few more minutes to allow mixture to thicken and fully emulsify.",
            "Pour into an 8oz cup and top with whipped cream and dust with cocoa powder, or some marshmallows, and/or a peppermint stick."
        ]
        
      },



      "eggnog": {
        "title": ["Eggnog"],
        "subtitle": ["eggy"],

        "ingredients": [
            "2 cups malk",
            "2½ whole cloves",
            "1¼ tsp vanilla extract, divided",
            "½ tsp ground cinnamon",
            "6 egg yolks",
            "¾ cup sugar",
            "2 cups light cream",
            "1 tsp vanilla extract",
            "¼ tsp ground nutmeg"
        ],

        "instructions": [
            "Combine milk, cinnamon, 1/4 teaspoon vanilla, and cloves in a saucepan over the lowest heat setting; stir and heat for 5 minutes. Increase heat to medium-low and slowly bring to a boil. Remove from the heat.",
            "Whisk egg yolks in a large bowl until light yellow in color. Add sugar and whisk until light and fluffy.",
            "Pour some of the hot milk mixture into the egg yolk mixture, whisking quickly to avoid scrambling the eggs. Continue adding hot milk and whisking to combine until all milk is incorporated.",
            "Pour the mixture back into the saucepan. Cook over medium heat, stirring constantly, until thick, about 3 minutes; do not allow the mixture to boil.",
            "Strain to remove cloves and let cool for about 1 hour, then stir in cream, remaining teaspoon of vanilla, and nutmeg. Refrigerate before serving, 8 hours to overnight."
        ]

      },



      "london_fog": {
        "title": ["London Fog"],
        "subtitle": ["Makes 14oz"],

        "ingredients": [
            "1 cup water",
            "2 Twinings earl grey tea bags",
            "¾ cup malk",
            "½-1 tbsp sugar",
            "<¼tsp vanilla extract"
        ],

        "optional": ["optional:"],
        "optional_ingredient": [
            "Edible lavender for garnish"
        ],

        "instructions": [
            "Boil water in a kettle or saucepan.",
            "Place tea bags in a cup, pour the boiling water over the bags and steep for 5mins, DON'T bob the bags, they aren't fishing rods.",
            "Pour milk into microwave safe cup and microwave, stirring and checking temp every 20s until it reaches at least 140ºF but no more than 160ºF.",
            "Use a frothing wand to incorporate air and texture the milk. Optionally, you can use a mason jar and shake until frothy.",
            "Remove the tea bags from the cup and dissolve in sugar and vanilla. Pour in milk and top with optional lavender."
        ]

      },



      "simple_syrup": {
        "title": ["Simple Syrup"],
        "subtitle": ["Looks complicated"],

        "ingredients": [
            "1 part sugar",
            "1 part water"
        ],

        "instructions": [
            "Heat in a saucepan over medium heat.",
            "Simmer until a thin syrupy consistency forms.",
            "Transfer into a mason jar, syrup will thicken as it cools."
        ]

      },



      "caramel_syrup": {
        "title": ["Caramel Syrup"],
        "subtitle": ["Probably burned it"],

        "ingredients": [
            "¾ cup sugar",
            "1 cup water",
            "½ tsp vanilla extract"
        ],

        "instructions": [
            "In a medium saucepan, add the sugar and ½ cup water. Heat over medium heat until it begins to simmer, swirling the pan occasionally by gently lifting and turning in a circular motion.",
            "Once the sugar is completely dissolved, reduce the heat slightly, if needed, to keep it at a low boil. You do not need to stir it, but it can be swirled 1-2 times. Continue to low boil for approximately 15-18 minutes until a light golden amber color appears. Note: don't continue to boil or it can become too thick or burn quickly.",
            "While the mixture is simmering, heat the remaining ½ cup of water in the microwave or in a small saucepan. Using hot water for the next step will reduce splatters.",
            "Once the light golden color appears, remove the saucepan from the heat. Wearing oven mitts, carefully whisk in the remaining (hot) water into the caramel syrup; it will splatter, so be careful. If any syrup hardens, continue whisking and return to heat until it's dissolved again. Stir in the vanilla extract.",
            "Allow to cool before transferring to an airtight container. You can use it immediately if needed, but it will heat up iced beverages so mix it with milk or espresso first, before the ice. Store in the fridge for up to 2 weeks and use in your favorite beverages or recipes as desired."
        ]

      },



      "mocha_sauce": {
        "title": ["Mocha Syrup"],
        "subtitle": [""],

        "ingredients": [
            "1 part cocoa powder",
            "1 part water",
            "2 parts sugar",
            "a splash of vanilla",
            "a pinch of salt"
        ],

        "optional": ["For a peppermint mocha:"],
        "optional_ingredient": [
            "tiny sploosh of peppermint extract to taste."
        ],

        "instructions": [
            "Boil water.",
            "Combine all ingredients in a bowl and whisk until smooth and shiny."
        ]

      },



      "sauces_savory": {
        "subTab": true,
        "name": "Sauces and Dressings"
      },
      "coffee": {
        "subTab": true,
        "name": "Coffee"
      },
      "aeropress": {
        "subTab": true,
        "name": "Aeropress"
      },
      "sauces_sweet": {
        "subTab": true,
        "name": "Sauces and Toppings"
      },
      "syrups": {
        "subTab": true,
        "name": "Syrups"
      }
    }
  }
  
